#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
module.shared.data.terraform_remote_state.infrastructure_state: Reading...
module.shared.data.terraform_remote_state.infrastructure_state: Read complete after 1s

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.buckets.aws_s3_bucket_object.add_investment_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_investment_function_object" {
      ~ etag                   = "57e7df2d7008c3c7b65eb26cdda799c5" -> "6cb16e357f2b0372b7a50e5cb5aa5e1b"
        id                     = "lambdas/demo/add_investment_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_scenario_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_scenario_function_object" {
      ~ etag                   = "3788f3ca9847cb837dbd887e44d7aab9" -> "c625c08a6e70fcb5563ac47dfe6226c3"
        id                     = "lambdas/demo/add_scenario_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_tag_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_tag_function_object" {
      ~ etag                   = "50cfe056180b1f3ced2c0fb951fb6c3d" -> "d0763cef8d3bdd66a959256ffd3b9d76"
        id                     = "lambdas/demo/add_tag_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_user_to_customer_group_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_user_to_customer_group_function_object" {
      ~ etag                   = "3338b0ae0fabef57b7178c9412547a20" -> "ac091a69d020588e4eab87b3f1070413"
        id                     = "lambdas/demo/add_user_to_customer_group_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.assign_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "assign_company_permissions_function_object" {
      ~ etag                   = "4128595fb4896322d51a0f88da9865a2" -> "d29c8f38e4084455ef1bb2250f1386d4"
        id                     = "lambdas/demo/assign_company_permissions_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.authorize_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "authorize_function_object" {
      ~ etag                   = "4d5a2ed77bc7429d702c26f61da5cbf4" -> "ed1d6f6dac211a5420e136b52a9465ce"
        id                     = "lambdas/demo/authorize_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_company_publicly_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_company_publicly_function_object" {
      ~ etag                   = "4cad8c9e52c160d034dee79d9aeb4e19" -> "e275011e95959d943fde35a5df4e0ab6"
        id                     = "lambdas/demo/change_company_publicly_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_user_role_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_user_role_function_object" {
      ~ etag                   = "81b6db2cec02158a020b21f57782af4e" -> "8409094adb63ffafa0d9ea5db6b4c363"
        id                     = "lambdas/demo/change_user_role_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.connect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "connect_function_object" {
      ~ etag                   = "82b1947b91029fb01001a5f73695b2a4" -> "bb6edf75d4f2a82e73f4db36829e9aef"
        id                     = "lambdas/demo/connect.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_company_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_company_function_object" {
      ~ etag                   = "b92ffb7d131303149f999989018ac2d0" -> "95430b075bdf15ce6fddb3ae932ce7a7"
        id                     = "lambdas/demo/delete_company_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_scenarios_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_scenarios_function_object" {
      ~ etag                   = "30efeda4f726b03946fc99aba22dacb2" -> "ff2b46aa72336c2a164ebf6d5e999937"
        id                     = "lambdas/demo/delete_scenarios_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_tags_function_object" {
      ~ etag                   = "0094a083cc567a2205f013ad94864190" -> "33667c6c723bca36b2b8da204e88d753"
        id                     = "lambdas/demo/delete_tags_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.disconnect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "disconnect_function_object" {
      ~ etag                   = "b6054a6d436b75f795c5f95343aee14e" -> "b04c5c51618a38d00340bebe16794fa1"
        id                     = "lambdas/demo/disconnect.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.download_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "download_comparison_vs_peers_function_object" {
      ~ etag                   = "b18d05f276b6a4cb86ba1e43e9082b20" -> "73cda59546a0f549309b7b410652baed"
        id                     = "lambdas/demo/download_comparison_vs_peers_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.edit_modify_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "edit_modify_data_function_object" {
      ~ etag                   = "c43d1e3824da4a3b97af210ea673eb0e" -> "81698b79691e7ab884b6d4a50f72612c"
        id                     = "lambdas/demo/edit_modify_data_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_companies_function_object" {
      ~ etag                   = "73a3525e82c21ca7deb6837e6cf33b6e" -> "42a0274b6d056f36b1f09d0117197aed"
        id                     = "lambdas/demo/get_all_companies_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_public_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_public_companies_function_object" {
      ~ etag                   = "17a6ba5c446649365c7596118d0160d3" -> "fb0fe46e630c68aedcc7cefed5ad2d98"
        id                     = "lambdas/demo/get_all_public_companies_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_ranges_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_ranges_function_object" {
      ~ etag                   = "c9c8aafa641cc76599683a4eb6c0c1a1" -> "d16900b7a20a6bbdca3786d2c0211c27"
        id                     = "lambdas/demo/get_all_ranges_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_tags_function_object" {
      ~ etag                   = "bff862d2d38f219185c99699dfa1032c" -> "0e7ab8c80dfde85bf1d4de0a8e5856a5"
        id                     = "lambdas/demo/get_all_tags_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_by_metric_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_by_metric_report_function_object" {
      ~ etag                   = "4847992625bfadd227ff0bd118552f64" -> "ce9dc16854aa3f24c946e696ba8ab746"
        id                     = "lambdas/demo/get_by_metric_report_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_details_function_object" {
      ~ etag                   = "843f85011caed13e338e200803aa1b21" -> "b7f3a3a5345d62233620f45c33701bd0"
        id                     = "lambdas/demo/get_company_details_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_investments_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_investments_function_object" {
      ~ etag                   = "329024f0a63139263902c9e15e0cee2c" -> "6a26c30beb227c560bda310cead6ed1a"
        id                     = "lambdas/demo/get_company_investments_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_permissions_function_object" {
      ~ etag                   = "729dfcb9ef73047e0fb962337a133876" -> "c922501d5870508d9de941fc359730e8"
        id                     = "lambdas/demo/get_company_permissions_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_report_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_report_vs_peers_function_object" {
      ~ etag                   = "7feffae0a98bbadffeec6a058b6f1005" -> "3a9c4021d3160780737b5e59fb5ea70b"
        id                     = "lambdas/demo/get_company_report_vs_peers_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_comparison_vs_peers_function_object" {
      ~ etag                   = "faa82e5a9ae8b0ddd4db9bc742214b84" -> "3200ea9ca674cf1736bf675c3884d711"
        id                     = "lambdas/demo/get_comparison_vs_peers_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_dynamic_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_dynamic_report_function_object" {
      ~ etag                   = "73ae59aa85ace038963371d0e2fa8da1" -> "86d656f779196bfd1fbb592c1860fed0"
        id                     = "lambdas/demo/get_dynamic_report_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_edit_modify_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_edit_modify_data_function_object" {
      ~ etag                   = "4e65a87c18a074fcdbc7901add4798fe" -> "5ea377e45c0db6dfefb6660fd2fb3057"
        id                     = "lambdas/demo/get_edit_modify_data_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_full_year_total_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_full_year_total_function_object" {
      ~ etag                   = "6ba2428a7658baca45fb9bc9b395c630" -> "4e5f7357f2fc9772ca1eba2b397e2b1e"
        id                     = "lambdas/demo/get_full_year_total_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_investment_date_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_investment_date_report_function_object" {
      ~ etag                   = "ceaf4e0abf3fbe0e6084d53e18d4e887" -> "cca26ccee0ae1a29320dd816801c0cdf"
        id                     = "lambdas/demo/get_investment_date_report_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_metric_types_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_metric_types_function_object" {
      ~ etag                   = "d61b469d306a7979ef5b8cf766e37f2d" -> "5d7b85f26432a265e6a0cd29ff50bd6d"
        id                     = "lambdas/demo/get_metric_types_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_quarters_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_quarters_report_function_object" {
      ~ etag                   = "e5a81844d54291b93e7f5be1aaf55e2c" -> "93d9505ec333036c106ddaea00a0b9ca"
        id                     = "lambdas/demo/get_quarters_report_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_ranges_by_metric_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_ranges_by_metric_function_object" {
      ~ etag                   = "93ef87cfd24f93ebfc7475296a4b212b" -> "e2d27195c4ec04f843ed2981d7b40e17"
        id                     = "lambdas/demo/get_ranges_by_metric_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_roles_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_roles_function_object" {
      ~ etag                   = "d389acca54530a36b5461c3b72f7ddaf" -> "83e336294b520c74c5f2fdc07ff89730"
        id                     = "lambdas/demo/get_roles_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_tags_by_company_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_tags_by_company_function_object" {
      ~ etag                   = "59b202daae3eb987a792b3235ba33a9f" -> "3a2070d0dab32de3a5d1e46e1344d97c"
        id                     = "lambdas/demo/get_tags_by_company_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_universe_overview_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_universe_overview_function_object" {
      ~ etag                   = "7ffa0824538bb8aaa7c1e01e758bce4a" -> "da63f3300ddfe1b2cef9ff4580c60a59"
        id                     = "lambdas/demo/get_universe_overview_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_user_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_user_details_function_object" {
      ~ etag                   = "410744dd310b75ddd72c69d9c692a0c9" -> "d52373df746f2d6f6bc5846d8c25d9fb"
        id                     = "lambdas/demo/get_user_details_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_users_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_users_function_object" {
      ~ etag                   = "65b7280c8faa0d2a3d1054f667b8fea0" -> "ea71319e553099b9c2dfa609e258949c"
        id                     = "lambdas/demo/get_users_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.glue_trigger_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "glue_trigger_function_object" {
      ~ etag                   = "b25a9d77a1b23a599e80d1a43d6077a7" -> "af54d8219a5aad78a0a7683b0433cba3"
        id                     = "lambdas/demo/glue_trigger_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.layer_libraries_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "layer_libraries_object" {
      ~ etag                   = "45b55f3b8cd5f52c117f04c3a028e2e8" -> "3f5490ad42dda8ede826d4416ba546a8"
        id                     = "layer/demo/layer_libraries.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.message_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "message_function_object" {
      ~ etag                   = "8e99825a2b9d9bbd16fb92d155271739" -> "a997e7c273592936fecf0881887f687c"
        id                     = "lambdas/demo/message.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.modify_ranges_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "modify_ranges_function_object" {
      ~ etag                   = "0c4d1a4b9125b515e0c8ec194bce82ac" -> "2d5ca8a37988b0d196274e3ec7d49459"
        id                     = "lambdas/demo/modify_ranges_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.register_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "register_function_object" {
      ~ etag                   = "a82aa38a051f8139e9ac98a867339815" -> "209075ebcf209e29ec68fe4d95363656"
        id                     = "lambdas/demo/register.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.update_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "update_data_function_object" {
      ~ etag                   = "d19aaae81f73f1a9ffd0e1ccc0473c21" -> "366ccad69f4b0604fca6692633c3e6fb"
        id                     = "lambdas/demo/update_data.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.update_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "update_tags_function_object" {
      ~ etag                   = "c9202f098bd7304518dd5e09b9ad78ee" -> "f1d6e0ed8efd823ce358e4aef36a2772"
        id                     = "lambdas/demo/update_tags_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.upload_file_s3_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "upload_file_s3_function_object" {
      ~ etag                   = "571f0a65a82dd60396a6ca7290ef34d1" -> "6fdc1a0b5824acd5bbd34fd6c93451fc"
        id                     = "lambdas/demo/upload_file_s3_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.validate_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "validate_data_function_object" {
      ~ etag                   = "406f4a95ec5b6dfc867ccfb975280aaa" -> "983d378e4c68191cde546d51f2a0a769"
        id                     = "lambdas/demo/validate_data_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.verify_users_with_same_email_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "verify_users_with_same_email_function_object" {
      ~ etag                   = "bcdf3a62cb64a2e81e65c6902814564c" -> "fdb616170e1d64bcc5c44c4ccb547f49"
        id                     = "lambdas/demo/verify_users_with_same_email_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.functions.aws_lambda_function.add_investment_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_investment_lambda_function" {
        id                             = "demo_add_investment_lambda_function"
      ~ last_modified                  = "2023-02-03T07:41:44.000+0000" -> (known after apply)
      ~ source_code_hash               = "xwm+aoys4laM3glwLemKzM31dQ0S0TfzM8OakW2iMdU=" -> "jeRTSLeiHQPOWJylYSW1us8DTVL7HRDJJSly5B1EhlU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_scenario_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_scenario_lambda_function" {
        id                             = "demo_add_scenario_lambda_function"
      ~ last_modified                  = "2023-02-03T07:41:56.000+0000" -> (known after apply)
      ~ source_code_hash               = "m99kbbBh/8Q7UC1QfN2CVFAcRsqXVwQIbm/tvu263D4=" -> "GBTCH4ueWyGf1+Rx0ga2vA9jFyAAqyBNL5u+wuetw0E="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_tag_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_tag_lambda_function" {
        id                             = "demo_add_tag_lambda_function"
      ~ last_modified                  = "2023-02-03T07:41:43.000+0000" -> (known after apply)
      ~ source_code_hash               = "TiBSblOERlt/sHuMucn8SpfVwQJnf1QVqgxSQtDv4Ks=" -> "ylzt2ekSPe0EcQKbA29XwdmhhO+dL/BGWFUbCF11//U="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_user_to_customer_group_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_user_to_customer_group_lambda_function" {
        id                             = "demo_add_user_to_customer_group_lambda_function"
      ~ last_modified                  = "2023-02-03T07:42:05.000+0000" -> (known after apply)
      ~ source_code_hash               = "lKJ4ChD3apQMyojKFi1pRATz7B7ueuKVyxNYhixuDGg=" -> "OBDs1wDzkLYbInYCw3H+kutIeshzH4Np9rSuqStAMRM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.assign_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "assign_company_permissions_lambda_function" {
        id                             = "demo_assign_company_permissions_lambda_function"
      ~ last_modified                  = "2023-02-03T07:41:28.000+0000" -> (known after apply)
      ~ source_code_hash               = "zHFS1w/N4akZ+41NlR/AF21rCMZyuNSwO1xjwcCPMoM=" -> "VS42shzLLtkUZJflUgHq+JszCPoI98xS8raSx0AeIK8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.authorize_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "authorize_lambda_function" {
        id                             = "demo_authorize_lambda_function"
      ~ last_modified                  = "2023-02-03T07:41:45.000+0000" -> (known after apply)
      ~ source_code_hash               = "+oga4d977S0jr5/DOZ1veVxyJZhk3NXZNK4nYJC9tFw=" -> "zR9j4UGrGwOyRolc7VmMJqdvWNVjr+yogJSw26z3jqE="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_company_publicly_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_company_publicly_lambda_function" {
        id                             = "demo_change_company_publicly_lambda_function"
      ~ last_modified                  = "2023-02-03T07:41:29.000+0000" -> (known after apply)
      ~ source_code_hash               = "1h9QqJPG4IQpGmZ0i6f6yuQdbz/8dPGuwl0oobhCCLY=" -> "B1PHgdNsj+CrolxUfXJ46U1S57mbxMHtTc0nycrCjg8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_user_role_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_user_role_lambda_function" {
        id                             = "demo_change_user_role_lambda_function"
      ~ last_modified                  = "2023-02-03T07:41:53.000+0000" -> (known after apply)
      ~ source_code_hash               = "dy0wEB93P2GPMkNkfihQqZwUzPkSHGyez2jaoaMWVKE=" -> "yZn1BfWpzsGCOLaGpxfY3ax+rxxcCvntOviZeOclAYE="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.connect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "connect_lambda_function" {
        id                             = "demo_connect_lambda_function"
      ~ last_modified                  = "2023-02-03T07:41:29.000+0000" -> (known after apply)
      ~ source_code_hash               = "mNftg8hYhgqvf7yDw8/NuyDB8idr1TMwcrZEclNwoeQ=" -> "7qR1KUQmakux7rBArw39H6d/h/QXvYmG2zkluvNQQO8="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.functions.aws_lambda_function.delete_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_company_lambda_function" {
        id                             = "demo_delete_company_lambda_function"
      ~ last_modified                  = "2023-02-03T07:42:05.000+0000" -> (known after apply)
      ~ source_code_hash               = "I3IpC2DozXpvIbxZme9P0SSO0e1dzGJgjAo3FG9n/SY=" -> "fLyhXTxIsyKkNkDi4TyvhUGewiX4VK4TeOuWVAt9GzI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.delete_scenarios_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_scenarios_lambda_function" {
        id                             = "demo_delete_scenarios_lambda_function"
      ~ last_modified                  = "2023-02-03T07:41:31.000+0000" -> (known after apply)
      ~ source_code_hash               = "Bapcxv+aAgBT+OaCYQnOLleDT29WTZl9FmiNGovy2cM=" -> "X1SOH+jxW0qTB7Mu1E0gc7K/R9LyJ9cISZdcO6vs4To="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.delete_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_tags_lambda_function" {
        id                             = "demo_delete_tags_lambda_function"
      ~ last_modified                  = "2023-02-03T07:41:55.000+0000" -> (known after apply)
      ~ source_code_hash               = "YklKY07FPBupAVSJ/tNsTlvmB4Cx5TwC6nX/9YzsNGU=" -> "xzSyo79dhqDYFUA2eACfT38WVx+9oXlWdGkaqFbfBvU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.disconnect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "disconnect_lambda_function" {
        id                             = "demo_disconnect_lambda_function"
      ~ last_modified                  = "2023-02-03T07:41:29.000+0000" -> (known after apply)
      ~ source_code_hash               = "4EYGTiheQ5QO5OquoKW08kPFo5Atk5DE+/Ho6U5R/Og=" -> "ctdpJkQrskheERQx1Q7JrcE+HTuOYCJ7cO9Wl8zWn4w="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.download_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "download_comparison_vs_peers_lambda_function" {
        id                             = "demo_download_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2023-02-03T07:42:05.000+0000" -> (known after apply)
      ~ source_code_hash               = "VQ49ajF8i8BCcwWYMbTry8CIajm/WN9JyfpBaEZ7lDI=" -> "zOl5aZce9gKz5W4+Xpf4WowgC/0+H80K61UGwuh2plE="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.edit_modify_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "edit_modify_data_lambda_function" {
        id                             = "demo_edit_modify_data_lambda_function"
      ~ last_modified                  = "2023-02-03T07:42:05.000+0000" -> (known after apply)
      ~ source_code_hash               = "9BYQf1zMDeQ7VxmEz6/3VDab8Do7P2ddG9Nbd9UM/ME=" -> "6YATzX5U2Jn6O+4OQE+b5cZYB623LwIzhWx6d5iGMVY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_companies_lambda_function" {
        id                             = "demo_get_all_companies_lambda_function"
      ~ last_modified                  = "2023-02-03T07:41:49.000+0000" -> (known after apply)
      ~ source_code_hash               = "qiHWduLehLrYvBy0ALSwz3thl5SVJybBvJXZo22aLeA=" -> "0T3xYy+PNRttoyLt6ItmIS04CNCBHrVURfGrzQscSNE="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_public_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_public_companies_lambda_function" {
        id                             = "demo_get_all_public_companies_lambda_function"
      ~ last_modified                  = "2023-02-03T07:42:19.000+0000" -> (known after apply)
      ~ source_code_hash               = "bQQUrDU0T+ow8iA0ugTAElOcSXXL46NgKiTLqf5w40k=" -> "HYEj3ovhRpo7kBy8qkwq+hOSLS5fPGm7G4A9xZJ74q0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_ranges_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_ranges_lambda_function" {
        id                             = "demo_get_all_ranges_lambda_function"
      ~ last_modified                  = "2023-02-03T07:42:05.000+0000" -> (known after apply)
      ~ source_code_hash               = "Hm8Fq6ensImSqGEBzASJQemVpaQhcB26utSQWNm+69g=" -> "jLe/blxkE8aYqpHPLXKAv6+n/V260mF3JffOVJRMcuk="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_tags_lambda_function" {
        id                             = "demo_get_all_tags_lambda_function"
      ~ last_modified                  = "2023-02-03T07:41:42.000+0000" -> (known after apply)
      ~ source_code_hash               = "D7vxwMI0VC+WgmYBrV+PsyMwxBx1RQyFqE5IcEqwGm8=" -> "FhswdKxSKmSIFKhQQs0tpv8eAUo+B2eVAnPb3tH+ujk="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_by_metric_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_by_metric_report_lambda_function" {
        id                             = "demo_get_by_metric_report_lambda_function"
      ~ last_modified                  = "2023-02-03T07:41:28.000+0000" -> (known after apply)
      ~ source_code_hash               = "gWqGCw6XrIyE0u/IUJSE0A6JJu8Z25yiU6Ga+2Kk2rA=" -> "Td2JoztYi0j1NQNao4SXOowVyvohEx5Tjn9O4r8ngQU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_details_lambda_function" {
        id                             = "demo_get_company_details_lambda_function"
      ~ last_modified                  = "2023-02-03T07:41:42.000+0000" -> (known after apply)
      ~ source_code_hash               = "cD9WEkBlxLYRxNUPk5cNRukH+lGUBTQKxKvPn9Ho5Oc=" -> "BOY3ZiICRURSuaXE5lhUNP8b6voB6/LCT3xCGlDNlYc="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_investments_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_investments_lambda_function" {
        id                             = "demo_get_company_investments_lambda_function"
      ~ last_modified                  = "2023-02-03T07:41:31.000+0000" -> (known after apply)
      ~ source_code_hash               = "rJqfftO8Se8mWFrdtNiTao2JTpL3+aY4TZ3MnSxGWUw=" -> "BFs3wDxKNWV9eLRZp7yOaqoxQ4AZlC1Wtmyh0AE01og="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_permissions_lambda_function" {
        id                             = "demo_get_company_permissions_lambda_function"
      ~ last_modified                  = "2023-02-03T07:41:28.000+0000" -> (known after apply)
      ~ source_code_hash               = "krIkaCfsFGAVlqmICq2WWHv8IFTXudxy3FJV6YbHuBg=" -> "LsG5h3q+56D7RNTUJMxAC9fiqFcxIPy0tjompOwi+B0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_report_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_report_vs_peers_lambda_function" {
        id                             = "demo_get_company_report_vs_peers_lambda_function"
      ~ last_modified                  = "2023-02-03T07:41:43.000+0000" -> (known after apply)
      ~ source_code_hash               = "n8iWEQ25RGECFbHbOxuzv3ZB2qEHc/l/7cBAjWl9cMY=" -> "o8ZwRYUWM8PVDhbjSzvS3UCBanOZFuKw+iaDu40UXVk="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_comparison_vs_peers_lambda_function" {
        id                             = "demo_get_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2023-02-03T07:42:05.000+0000" -> (known after apply)
      ~ source_code_hash               = "TBjkuWbuyOKg9OWX6gY0Su80gQD99nJ3Z1VaAqrZ6dM=" -> "yVbbem6DZJiCIs+1jS5in9+Ts5I/AJqqK2on65Sw8jI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_dynamic_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_dynamic_report_lambda_function" {
        id                             = "demo_get_dynamic_report_lambda_function"
      ~ last_modified                  = "2023-02-03T07:42:19.000+0000" -> (known after apply)
      ~ source_code_hash               = "beXM3QnGZjyKdxt+5bqtjwHcyGgPA4w/pNbLcUelmk4=" -> "xeqZEz4/kAEcsLxduTBSO7uxcPLfdByXKZB16rP53GA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_edit_modify_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_edit_modify_data_lambda_function" {
        id                             = "demo_get_edit_modify_data_lambda_function"
      ~ last_modified                  = "2023-02-03T07:42:19.000+0000" -> (known after apply)
      ~ source_code_hash               = "8B//IRMBXi6bNtohBuIRcGlVyyIAKz86Eyx2XZudSSQ=" -> "Lv5oJq4u7WSmWo3QOglDzMe4FuH9vCqsVijNnV02pw4="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_full_year_total_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_full_year_total_lambda_function" {
        id                             = "demo_get_full_year_total_lambda_function"
      ~ last_modified                  = "2023-02-03T07:41:54.000+0000" -> (known after apply)
      ~ source_code_hash               = "lC1FmgkT5ZQbpXXEOMskDJpQjlzBPiklYBCd53IGo6s=" -> "uqixGEo3L2rlPfEY51vFfmMhRcZlhVHQWU/mGd5Iw0s="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_investment_date_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_investment_date_report_lambda_function" {
        id                             = "demo_get_investment_date_report_lambda_function"
      ~ last_modified                  = "2023-02-03T07:41:38.000+0000" -> (known after apply)
      ~ source_code_hash               = "zcQ5pjPZwrGTqp/C89uj9jV3lUiiSUflCSvhmbJk1Z4=" -> "+eQJVJMRhuVb9IKF9AoF+VVvZ9sHTRqDgxfWZ+Ab1zY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_metric_types_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_metric_types_lambda_function" {
        id                             = "demo_get_metric_types_lambda_function"
      ~ last_modified                  = "2023-02-03T07:41:40.000+0000" -> (known after apply)
      ~ source_code_hash               = "6hkOPDDfAMSHBjbFtp+H2Hvdb4sMibwVy+sxoOQ84KM=" -> "sEQp0K10a9It4AwmsIlBmzOsmurJxhwRZqjhr+RI7vI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_quarters_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_quarters_report_lambda_function" {
        id                             = "demo_get_quarters_report_lambda_function"
      ~ last_modified                  = "2023-02-03T17:16:07.000+0000" -> (known after apply)
      ~ source_code_hash               = "TY/1fuDPZJ3hOWgHtOP/YmC1tKricu8D7bBCffs0KEI=" -> "WGoeDJz1GuKqkhNBmuGqKZue3S9SN6TeBney4w6KsWY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_ranges_by_metric_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_ranges_by_metric_lambda_function" {
        id                             = "demo_get_ranges_by_metric_lambda_function"
      ~ last_modified                  = "2023-02-03T07:41:42.000+0000" -> (known after apply)
      ~ source_code_hash               = "aa+vWUHgeNxVQHVVD8Gj5VpG/hEkmwQANxCApQzAoLg=" -> "AL5dkePxuvsmR1OGX0tlz71CMQicqdfGlHL5xpQiRAs="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_roles_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_roles_lambda_function" {
        id                             = "demo_get_roles_lambda_function"
      ~ last_modified                  = "2023-02-03T07:41:54.000+0000" -> (known after apply)
      ~ source_code_hash               = "ObiT14FEby8/jmkhvjoeJtbBpOHtqaNdnu9rJ2OI/y0=" -> "aonajwqxTeQsdxK5wXKdmlKX5bbkfbdELQYwnw6/xzg="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_tags_by_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_tags_by_company_lambda_function" {
        id                             = "demo_get_tags_by_company_lambda_function"
      ~ last_modified                  = "2023-02-03T07:41:53.000+0000" -> (known after apply)
      ~ source_code_hash               = "ODBb4BnMAwn3pVIokHyP4gdxVjyDsNmP6WbyH1pESjc=" -> "kaiwV5NCKydA0LrLH0MCCTTBUYRrPM+fGYvfYIZ2nX8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_universe_overview_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_universe_overview_lambda_function" {
        id                             = "demo_get_universe_overview_lambda_function"
      ~ last_modified                  = "2023-02-03T07:41:28.000+0000" -> (known after apply)
      ~ source_code_hash               = "cZ0WGzTSTXuIC/sFj0YOBm8ztcGHIxJOqgvfBdmt+Sk=" -> "01HM3zFEXZL4cJBQZNL+cL2hsFnxY20UTeZp42Aonzs="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_user_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_user_details_lambda_function" {
        id                             = "demo_get_user_details_lambda_function"
      ~ last_modified                  = "2023-02-03T07:41:28.000+0000" -> (known after apply)
      ~ source_code_hash               = "0SCcUONwwVG00AeW3fUIqRxiNK51RvWR5RF3KnfkBWc=" -> "gWHfrHyTtfxbfC5rGjCTpbqXuWuJQJ9wCMB4//PHD+o="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_users_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_users_lambda_function" {
        id                             = "demo_get_users_lambda_function"
      ~ last_modified                  = "2023-02-03T07:41:54.000+0000" -> (known after apply)
      ~ source_code_hash               = "F5Bt66sSh13xbtA2O8peJFnWwpsofbM0/zOWM4TbMFw=" -> "d3BNH/dKMCXrIHetr34uBSDFInafr5oNp0kQab0FwQQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.glue_trigger_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "glue_trigger_lambda_function" {
        id                             = "demo_glue_trigger_lambda_function"
      ~ last_modified                  = "2023-02-03T07:42:05.000+0000" -> (known after apply)
      ~ source_code_hash               = "pfiZ/qkphf9P0mQvpw1PmJXwf8hfw5Mjijam9PEsv/0=" -> "ATu7EagmH6TkmzsKVZ3ffUjXdy3jpkTMGRgDxYN65lM="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.message_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "message_lambda_function" {
        id                             = "demo_message_lambda_function"
      ~ last_modified                  = "2023-02-03T07:42:19.000+0000" -> (known after apply)
      ~ source_code_hash               = "C3IqP8JCpZctg8T0Y0Mjc8j4KKT+f0Ay5K8Jv84C0nA=" -> "jGgBCeJW6ZXEHxs3vvZdpQbq+CYx2i98sQ8trfFl4rU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.modify_ranges_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "modify_ranges_lambda_function" {
        id                             = "demo_modify_ranges_lambda_function"
      ~ last_modified                  = "2023-02-03T07:42:05.000+0000" -> (known after apply)
      ~ source_code_hash               = "mvZzWvomp7sD//F/8bh/dCPwLg9OjaS/0PSYZzHz5F0=" -> "VDnGf0i9qAMH4JfC9reaab5/w5yEmLgj93qvmKh40kI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.register_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "register_lambda_function" {
        id                             = "demo_register_lambda_function"
      ~ last_modified                  = "2023-02-03T07:42:16.000+0000" -> (known after apply)
      ~ source_code_hash               = "MmQCYcvj4YCYnCa8nPjCdA8lZNhk7MLJsvzdZF8e10M=" -> "7EumZor7li345vqjpsU/1OHu7+UA3nLS3nqaFkaqNQg="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.update_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "update_data_lambda_function" {
        id                             = "demo_update_data_lambda_function"
      ~ last_modified                  = "2023-02-03T07:42:10.000+0000" -> (known after apply)
      ~ source_code_hash               = "/aOdUCsru9JBvpom/W/5LPfl8eaOAaBfwo5eG+/rKEs=" -> "/wR5pQQyugHE7pkPmOQ3v+wuhQIj6KXEmMWvxDn6Bfk="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.update_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "update_tags_lambda_function" {
        id                             = "demo_update_tags_lambda_function"
      ~ last_modified                  = "2023-02-03T07:42:06.000+0000" -> (known after apply)
      ~ source_code_hash               = "Gqoo3Sb/iM7P25W3RFv6LRii8lUfhqXxPf+wF7YyJ2Y=" -> "SaGlAOWPi8TZu370bOq1EAa7gu0xC6qBlT1tYf6Kpmg="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.upload_file_s3_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "upload_file_s3_lambda_function" {
        id                             = "demo_upload_file_s3_lambda_function"
      ~ last_modified                  = "2023-02-03T07:41:54.000+0000" -> (known after apply)
      ~ source_code_hash               = "g72H21hzjs5j+x0s/n1xP8hBuwU3VQ/c+S8NacRWwRk=" -> "j5JHyMQZsl6wxMgKlCVemwrfC9o9vU2lpk0DHLOTPDU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.validate_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "validate_data_lambda_function" {
        id                             = "demo_validate_data_lambda_function"
      ~ last_modified                  = "2023-02-03T07:41:42.000+0000" -> (known after apply)
      ~ source_code_hash               = "QUA1r8+lCwOGtqRRbBKW19SQa33cWhdDO3cW6PFXPbI=" -> "Wiu+Opvgkg1d5+atoXQLptk/IuO6kvaJ4HkTApA2Aww="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.verify_users_with_same_email_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "verify_users_with_same_email_lambda_function" {
        id                             = "demo_verify_users_with_same_email_lambda_function"
      ~ last_modified                  = "2023-02-03T07:42:19.000+0000" -> (known after apply)
      ~ source_code_hash               = "Jt04wz7VQqw+29CemxqdsUdykAe06EojceTyr9p+lKY=" -> "Yuq0GR0H5syyr1GoLBsrNGi2Xs4/vIvL5jw4xpdDPMY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.gateway_deployment.aws_api_gateway_deployment.gateway_deployment must be replaced
+/- resource "aws_api_gateway_deployment" "gateway_deployment" {
      ~ created_date      = "2023-02-03T07:41:23Z" -> (known after apply)
      ~ execution_arn     = "arn:aws:execute-api:us-west-2:435552912911:kb7gblbu69/demo" -> (known after apply)
      ~ id                = "30bbte" -> (known after apply)
      ~ invoke_url        = "https://kb7gblbu69.execute-api.us-west-2.amazonaws.com/demo" -> (known after apply)
      ~ stage_description = "Deployed at 2023-02-03T07:41:21Z" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.network.aws_apigatewayv2_deployment.deploy will be updated in-place
  ~ resource "aws_apigatewayv2_deployment" "deploy" {
      ~ description   = "Deployed at 2023-02-03T07:41:21Z" -> (known after apply)
        id            = "ey3sgf"
        # (2 unchanged attributes hidden)
    }

  # module.network.aws_apigatewayv2_stage.stage will be updated in-place
  ~ resource "aws_apigatewayv2_stage" "stage" {
        id              = "demo"
        name            = "demo"
        tags            = {}
        # (8 unchanged attributes hidden)

      - access_log_settings {
          - destination_arn = "arn:aws:logs:us-west-2:435552912911:log-group:testing_websocket_api" -> null
          - format          = jsonencode(
                {
                  - caller       = "$context.identity.caller"
                  - connectionId = "$context.connectionId"
                  - eventType    = "$context.eventType"
                  - ip           = "$context.identity.sourceIp"
                  - requestId    = "$context.requestId"
                  - requestTime  = "$context.requestTime"
                  - routeKey     = "$context.routeKey"
                  - status       = "$context.status"
                  - user         = "$context.identity.user"
                }
            ) -> null
        }

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 95 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didnt use the -out option to save this plan, so Terraform cant
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @dsgarcia8, Action: `pull_request`*